// Напишите программу, которая заполнит спирально массив 4 на 4.
int[,] a = new int[4, 4];
a[0, 0] = 01;
a[0, 1] = 02;
a[0, 2] = 03;
a[0, 3] = 04;
a[1, 3] = 05;
a[2, 3] = 06;
a[3, 3] = 07;
a[3, 2] = 08;
a[3, 1] = 09;
a[3, 0] = 10;
a[2, 0] = 11;
a[1, 0] = 12;
a[1, 1] = 13;
a[1, 2] = 14;
a[2, 2] = 15;
a[2, 1] = 16;
for (int i = 0; i < 4; i++)
{
    for (int j = 0; j < 4; j++)
    {
        Console.Write(a[i, j] + " ");
    }
    Console.WriteLine();
}
// про заполнение случайными числами ничего не сказано, про циклы и функции тоже
// просто заполнить "в порядке спирали"